订单状态 
2.0                2.1【直投】         2.1【预约】
-1 计划未提交          待提交              待提交
0 待支付               待支付           
1 待接单               待接单              待审核
2 拒单                 已拒单              审核失败
3 流单                 已流单            
4 强制终止             已取消              已取消
5 已完成               已完成              已完成
6 待确认接单 
10 待提交大纲 
12 待确认大纲 
14 待提交内容 
16 待确认内容 
18 待提交预览 		  （已反馈）
20 待确认预览 		（待确认执行链接）
22 待投放             待执行链接           执行中
24 待提交效果         待效果截图
26 待确认效果

活动状态
2.0                      2.1
0 待提交                待提交
1 待支付                待支付
2 执行中                执行中
3 执行完                已完成
9 取消