<?php
/**
 * Yii::$app->params['xxx']
 */
return [
    'adminEmail' => 'admin@example.com',
    'supportEmail' => 'support@example.com',
    'user.passwordResetTokenExpire' => 3600,
    'media.upload.file.path' => '../upload/file/',//上传文件的展示路径
    'media.upload.image.path' => '../upload/img/',//上传图片的展示路径
    // ************************************************************
    //                      媒体资源 : 微信
    // ************************************************************
    'media.weixin' => ['code' => 1, 'name' => '微信'],

    // 微信投放位置
    // 注: s_1, s, m_1, m_2, m_3 待删除
    'media.weixin.pub-pos' => ['s_1' => '单图文', 's' => '单图文', 'pos_s' => '单图文', 'm_1' => '多图文头条', 'pos_m_1' => '多图文头条', 'm_2' => '多图文第2条', 'pos_m_2' => '多图文第2条', 'm_3' => '多图文第3-N条', 'pos_m_3' => '多图文第3-N条'],

    // 微信自媒体所属类型
    'media.weixin.belong-type' => [1 => '媒体', 2 => '机构', 3 => '个人', -1 => '其他'],


    // ************************************************************
    //                      媒体资源 : 微博
    // ************************************************************
    'media.weibo' => ['code' => 2, 'name' => '微博'],



    // ************************************************************
    //                      媒体资源 : 视频直播
    // ************************************************************
    //展示网红头像的相对路径
    'video.avatar.path' => '../upload/img/avatar/',

    'media.video' => ['code' => 3, 'name' => '视频直播'],

    // 视频资源的分类
    'media.video.category' => [
        1 => '名人/艺人', 2 => '段子手', 3 => '娱乐搞笑', 4 => '时尚搭配', 5 => '美容美妆', 6 => '游戏/动漫', 7 => '影视/音乐', 8 => '体育/健身', 9 => '美食',
        10 => '母婴/育儿', 11 => '汽车', 12 => '旅游/摄影', 100 => '其他'
    ],

    // 视频&直播平台
    'media.video.platform' => [
        '1' => '花椒',
        '2' => '熊猫',
        '3' => '哈你',
        '4' => '美拍',
        '5' => '秒拍',
        '6' => '斗鱼',
        '7' => '映客',
        '8' => '淘宝',
        '9' => '一直播',
        '10' => '快手',
        '11' => '小咖秀',
        '12' => 'B站',
    ],

    // 合作形式
    'media.video.biz-coop' => [
        1 => '线上直播', 2 => '线下直播', 3 => '原创视频+发布', 4 => '视频直发', 5 => '视频转发'
    ],

    // 花椒的业务合作形式
    'media.video.huajiao.biz-coop-config' => [1, 2],
    // 熊猫的业务合作形式
    'media.video.panda.biz-coop-config' => [1,2],
    // 哈你的业务合作形式
    'media.video.hani.biz-coop-config' => [1,2],
    // 美拍的业务合作形式
    'media.video.meipai.biz-coop-config' => [1,2,3,4,5],
    // 秒拍的业务合作形式
    'media.video.miaopai.biz-coop-config' => [3,4],
    // 斗鱼的业务合作形式
    'media.video.douyu.biz-coop-config' => [1,2],
    // 映客的业务合作形式
    'media.video.yingke.biz-coop-config' => [1,2],
    // 淘宝直播的业务合作形式
    'media.video.taobao.biz-coop-config' => [1,2],
    //
    'media.video.yizhibo.biz-coop-config' => [1,2],

    // ************************************************************
    //                      平台配置
    // ************************************************************
    // deposit-percent 定金比例 | serve-percent 技术服务费率 | orig-retail-ratio 零售价与平台合作价之间的比率(1 表示零售价=平台合作价; 1.5 表示零售价是平台合作价的1.5倍)
    'platform.global-config' => ['deposit-percent' => 0.5, 'serve-percent' => 0.4, 'orig-retail-ratio' => 1.1],

    // 媒体资源分类(适用微信和微博)
    "media.category" => [
        1 => '新闻资讯', 2 => '生活', 3 => '段子手', 4 => '汽车', 5 => '时尚', 6 => '美容美妆', 7 => 'IT/互联网', 8 => '电商', 9 => '科技数码',
        10 => '母婴/育儿', 11 => '教育培训', 12 => '健康养生', 13 => '家居房产', 14 => '美食', 15 => '游戏动漫', 16 => '娱乐八卦', 17 => '旅游/摄影', 18 => '影视音乐', 19 => '金融财经',
        20 => '广告/营销', 21 => '职场/管理', 22 => '名人/艺人', 23 => '情感/星座', 24 => '文化创意', 25 => '体育健身', 26 => '其他'
    ],

    // 省份&城市
    'common.city' => [
        // 省份
        0 => '全国', 1 => '北京', 2 => '天津', 3 => '河北', 4 => '山西', 5 => '内蒙古', 6 => '辽宁', 7 => '吉林', 8 => '黑龙江', 9 => '上海',
        10 => '江苏', 11 => '浙江', 12 => '安徽', 13 => '福建', 14 => '江西', 15 => '山东', 16 => '河南', 17 => '湖北', 18 => '湖南', 19 => '广东',
        20 => '广西', 21 => '海南', 22 => '重庆', 23 => '四川', 24 => '贵州', 25 => '云南', 26 => '西藏', 27 => '陕西', 28 => '甘肃', 29 => '青海',
        30 => '宁夏', 31 => '新疆', 32 => '台湾', 33 => '香港', 34 => '澳门', 35 => '海外',

        36 => '其他',

        // 城市
        289 => '广州', 291 => '深圳', 162 => '南京', 175 => '杭州', 385 => '成都', 73 => '石家庄', 84 => '太原', 107 => '沈阳', 108 => '大连', 121 => '长春',
        130 => '哈尔滨', 166 => '苏州', 163 => '无锡', 176 => '宁波', 186 => '合肥', 203 => '福州', 204 => '厦门', 212 => '南昌', 223 => '济南', 224 => '青岛',
        240 => '郑州', 258 => '武汉', 275 => '长沙', 310 => '南宁', 324 => '海口', 406 => '贵阳', 415 => '昆明', 438 => '西安', 448 => '兰州', 462 => '西宁'
    ],

    // 媒体+供应商bind status
    'media.vendor-bind-status' => [
        0 => '待审核', 1 => '审核通过', 2 => '审核未通过', 5 => '信息未填写完成'
    ],

    // 资源所属关系 - 资源跟某个媒体主(即供应商)之间的所属关系
    'media.ownership' => [
        1 => '自营', 2 => '独家', 4 => '代理', -1 => '其他'
    ],

    // 配合度
    'media.coop-degree' => [
        1 => '高', 2 => '中', 3 => '低', -1 => '未知'
    ],

    // 账期
    'media.pay-period' => [1 => '年框', 2 => '3个月以上', 3 => '1-3个月', 4 => '1-4个周', 5 => '无', -1 => '未知'],

    /**************  文件上传和存储 ***************/
    /* 七牛云存储配置 */
    'qiniu' => [
        'accessKey' => '',
        'secretKey' => '',
        'bucket' => [
            '51wom-img-bucket' => '51wom-img-bucket'
        ],
        'domain' => [
            '51wom-img-bucket' => 'xxxxxxx'
        ]
    ],

    // TODO
    'sms_yuntongxun' => [
        'sms_verify_code' => '',
        '' => ''
    ]
];
